[{"rank":1,"user":"dragonwriter","sugar_score":5.3001742297,"sweetest_comment":"I was asking if the things that they are buying are fairly described as buying innovations."},{"rank":2,"user":"eru","sugar_score":5.1970052119,"sweetest_comment":"Pull requests seem especially apt."},{"rank":3,"user":"ChuckMcM","sugar_score":5.1094136945,"sweetest_comment":"Theia, baseball of God sounds like a good title :-)"},{"rank":4,"user":"pg","sugar_score":4.9852685375,"sweetest_comment":"Good point; added them."},{"rank":5,"user":"rbanffy","sugar_score":4.517170025,"sweetest_comment":"So, they experienced a Schrödinger situation..."},{"rank":6,"user":"tptacek","sugar_score":4.4016369464,"sweetest_comment":"Wow, this is a great comment. I hope lots of people read it."},{"rank":7,"user":"jacquesm","sugar_score":4.1283243917,"sweetest_comment":"Yes, that's free so it's yours."},{"rank":8,"user":"rdl","sugar_score":4.1052527021,"sweetest_comment":"Just wait for a YC S13 startup announcement for some kind of bitcoin wallet developer tool or optimized way to spend bitcoins on mobile devices... :)"},{"rank":9,"user":"lmm","sugar_score":4.0488978153,"sweetest_comment":"I havent installed Linux on it yet, but Ive been really impressed by the Microsoft Surface Book - even leaving aside the tablet functionality its just a really nice laptop, with the best features vs size&#x2F;weight Ive seen going."},{"rank":10,"user":"rms","sugar_score":4.0018870394,"sweetest_comment":"Are you saying that tumbleblogs takes copyright over the content that people publish there? I thought that all the hosted blogging platforms let people own their own data."},{"rank":11,"user":"wmf","sugar_score":3.9560186813,"sweetest_comment":"If the authors got fired would you still suspect they engineered it? In reality this kind of stuff spirals out of control chaotically so its incredibly risky to do it on purpose."},{"rank":12,"user":"davidw","sugar_score":3.9300936636,"sweetest_comment":"It would be nice to be able to have a 'more' button on our own comments pages."},{"rank":13,"user":"jrockway","sugar_score":3.7228022599,"sweetest_comment":"The erasers tasted really good, though."},{"rank":14,"user":"scott_s","sugar_score":3.4220562354,"sweetest_comment":"You sound happy to be ignorant."},{"rank":15,"user":"staunch","sugar_score":3.2758996726,"sweetest_comment":"Brings to mind the masses of spaghetti code, with thousands of embeded SQL queries, that power(ed) many very successful sites."},{"rank":16,"user":"chc","sugar_score":3.2711583936,"sweetest_comment":"In what kind of bizarro business model are price increases and innovation interchangeable?"},{"rank":17,"user":"jerf","sugar_score":3.2700145243,"sweetest_comment":"My cheap POC phone does that, and I do prefer it.I think it is because the \"varying heights\" icon has become part of brand identity. Woe betide the putatively-informational display that becomes part of the \"brand identity\"."},{"rank":18,"user":"nl","sugar_score":3.1869015864,"sweetest_comment":"Ive said it before.Pinterest is what Delicious should have been, if Yahoo had any vision at all."},{"rank":19,"user":"jdp23","sugar_score":3.1824280877,"sweetest_comment":"excellent point in the edit!"},{"rank":20,"user":"pjmlp","sugar_score":3.1770251513,"sweetest_comment":"So one gets down-voted for stating the truth that Java is not constrained to the JVM, great!"},{"rank":21,"user":"mtgx","sugar_score":3.1415632077,"sweetest_comment":"Nice try Facebook PR."},{"rank":22,"user":"patio11","sugar_score":3.0877585318,"sweetest_comment":"No form of advertising captures intent like search advertising.  No data source, statistics, or demograpic information comes close to a user saying \"I want to buy widgets, show me your widgets.\"   Until Amazon or Facebook or whomever capture intent like Google does, their advertising will be doomed to being fractionally as effective."},{"rank":23,"user":"ck2","sugar_score":3.0714252098,"sweetest_comment":"This is why we can't have nice things."},{"rank":24,"user":"steveklabnik","sugar_score":3.0003874133,"sweetest_comment":"IntelliJ has their own stuff, it does not use the RLS."},{"rank":25,"user":"tomjen3","sugar_score":2.9228090271,"sweetest_comment":"Good parents will learn not to listen too closely to whether their children are asleep or reading - great parents will make sure the flashlight batteries are periodically replaced."},{"rank":26,"user":"ekianjo","sugar_score":2.9206805523,"sweetest_comment":"Twitter was never designed to be a conversation platform. Its like trying to make a boat fly."},{"rank":27,"user":"pavel_lishin","sugar_score":2.8357445984,"sweetest_comment":"I would be alright with that as well, if every piece of software I'd ever written was 100% bug free. I envy your perfect track record."},{"rank":28,"user":"DanielBMarkham","sugar_score":2.8295904798,"sweetest_comment":"Care to explain yourself? Would you be happy if people stopped reproducing?"},{"rank":29,"user":"sp332","sugar_score":2.8024986923,"sweetest_comment":"4GL like SQL? Push technologies like SMS, IM, and websockets? You could use better examples :)"},{"rank":30,"user":"eli","sugar_score":2.8021812837,"sweetest_comment":"You don't think which claim holds up? That circumcision cuts infection rates? As I posted in a comment below, there's a fair bit of scientific evidence to support that."},{"rank":31,"user":"zobzu","sugar_score":2.7829793711,"sweetest_comment":"Yeah I wasnt very happy that day. ;-)"},{"rank":32,"user":"_pius","sugar_score":2.7499242641,"sweetest_comment":"This is a superb article."},{"rank":33,"user":"brudgers","sugar_score":2.7464653524,"sweetest_comment":"Thats a great rationalization for dehumanizing people who are incarcerated."},{"rank":34,"user":"ErrantX","sugar_score":2.6811113455,"sweetest_comment":"Great post! I specifically like how it is written non-regionalised :) so the advice applies pretty much anywhere.+1"},{"rank":35,"user":"petervandijck","sugar_score":2.657293835,"sweetest_comment":"It's very good."},{"rank":36,"user":"DanBC","sugar_score":2.5607021689,"sweetest_comment":"Why can't they believe in both, and be working towards some kind of merge?"},{"rank":37,"user":"sliverstorm","sugar_score":2.544865593,"sweetest_comment":"They must be blessed by excellent sysadmins to have forgotten them"},{"rank":38,"user":"danielweber","sugar_score":2.4596423116,"sweetest_comment":"I think lots of people would balk at those constraints, but Joss Whedon sees them and thinks this is awesome!"},{"rank":39,"user":"TeMPOraL","sugar_score":2.4593838422,"sweetest_comment":"Can you get your own data from the system?"},{"rank":40,"user":"ugh","sugar_score":2.4449118955,"sweetest_comment":"Could be brilliant satire. Well, I doubt it :)"},{"rank":41,"user":"stcredzero","sugar_score":2.4354012454,"sweetest_comment":"If you look at data relating to user conversion, and users staying on and revisiting websites, fast would seem to be just about everyones favorite feature!"},{"rank":42,"user":"anigbrowl","sugar_score":2.4108297908,"sweetest_comment":"From his shareholders' point of view, the joy of haing children isn't fungible unless they live in close proximity to their investment. Of course, there's an argument tht being happy will make Merrill more productive, but that presupposes he likes children."},{"rank":43,"user":"sidcool","sugar_score":2.4069570229,"sweetest_comment":"1 Terabyte Google Drive cloud storage!!!!  Jesus it's brilliant!"},{"rank":44,"user":"bane","sugar_score":2.4025664287,"sweetest_comment":"Didn't Apple just build a couple huge data centers? I was under the assumption they were supposed to be for iCloud?"},{"rank":45,"user":"PaulHoule","sugar_score":2.3845762292,"sweetest_comment":"if they get rid of that conduit.com BS I'll be happy"},{"rank":46,"user":"Tichy","sugar_score":2.3716258364,"sweetest_comment":"Sounds like a good idea for an Onion article :-)"},{"rank":47,"user":"SkyMarshal","sugar_score":2.3268766002,"sweetest_comment":"Yes, turns out that ATI acquisition may save them.  Nice hedge against struggles on the CPU side."},{"rank":48,"user":"ghaff","sugar_score":2.3072437316,"sweetest_comment":"Engineer is an incredibly widely-used term as part of titles. In addition to SWEs etc., youve got sales engineers, systems engineers, field engineers, etc. When I was in the oil business there were titles like mud engineer (which people joked should have been called mud salesmen). The majority of these people dont have engineering degrees and have never worked in what most would consider an engineering role."},{"rank":49,"user":"gaius","sugar_score":2.2955177277,"sweetest_comment":"Do cops and doctors get “free time” between cases?Airline pilots do between flights. You can cherrypick an example for anything."},{"rank":50,"user":"petercooper","sugar_score":2.2670727756,"sweetest_comment":"Yeah, it doesn't seem to support tag unions anymore. I know it didn't for a long time when you were running it too, but then when it did, it was an awesome way to find things based on topic."},{"rank":51,"user":"dasil003","sugar_score":2.2272407954,"sweetest_comment":"One thing's for sure though; they ain't new-fangled!"},{"rank":52,"user":"grandalf","sugar_score":2.1873196968,"sweetest_comment":"It will just be so nice to have the port be standardized."},{"rank":53,"user":"jonknee","sugar_score":2.1819658499,"sweetest_comment":"&gt; That kinda already exists though, with team driving. Two pilots relaying gives ~22h of driving per 24h plus 2x30mn slack (under US regs, though theres still a limit of 70h&#x2F;8 days followed by 34h rest per driver).So at minimum labor costs could halve... Sounds like a huge productivity boost."},{"rank":54,"user":"ricardobeat","sugar_score":2.158901181,"sweetest_comment":"tl;drI'm in the optional semi-colons camp, and it is a bug in the minifier :)"},{"rank":55,"user":"pyre","sugar_score":2.1467768106,"sweetest_comment":"Think of this from the point of view of people that don't know anything about computers. \"bug == defect\" and \"hacking == magic\""},{"rank":56,"user":"krapp","sugar_score":2.144640674,"sweetest_comment":"As someone who's experienced both depression and obsessive navel-gazing at 35 I can attest to its counterproductive nature."},{"rank":57,"user":"JustSomeNobody","sugar_score":2.1390205491,"sweetest_comment":"Shame the person earning that can’t afford their own childcare."},{"rank":58,"user":"amelius","sugar_score":2.0774910996,"sweetest_comment":"This reminds me of Norton Commander :)"},{"rank":59,"user":"breck","sugar_score":2.071438589,"sweetest_comment":"Awesome."},{"rank":60,"user":"tzs","sugar_score":2.0672717982,"sweetest_comment":"&gt; The lawmaker cautioned against overreacting to what he described as an “extraordinary crash.”Isnt dealing with extraordinary situations the point of insurance?"},{"rank":61,"user":"nostrademons","sugar_score":2.0397695718,"sweetest_comment":"Looking purely at the graph, I'd say the conclusion should be \"think about how your startup will be more engaging than TV\"."},{"rank":62,"user":"ericd","sugar_score":2.034064309,"sweetest_comment":"It wasnt very good for Apple, though..."},{"rank":63,"user":"danso","sugar_score":2.0276913942,"sweetest_comment":"I'm all for unique uses of programmatic data collection, but this is a huge, huge stretch, with no practical implementation details."},{"rank":64,"user":"rdtsc","sugar_score":2.025586942,"sweetest_comment":"It is a good point, it made it seems like he was awarded a tittle by the state itself."},{"rank":65,"user":"statictype","sugar_score":2.0125995013,"sweetest_comment":"Nice. What strategies did you use for organic growth of your website?"},{"rank":66,"user":"rokhayakebe","sugar_score":2.0096427871,"sweetest_comment":"great great"},{"rank":67,"user":"Pxtl","sugar_score":1.9904439367,"sweetest_comment":"Arent we, like, not supposed to do this kind of thing anymore?"},{"rank":68,"user":"moron4hire","sugar_score":1.9826358293,"sweetest_comment":"To be fair, that is often a good assumption to make."},{"rank":69,"user":"atmosx","sugar_score":1.972696608,"sweetest_comment":"I wot my own... And was displaying the prices at the desktop... Its just 10 lines of ruby and geektool."},{"rank":70,"user":"ThomPete","sugar_score":1.9492526212,"sweetest_comment":"One of the most brilliant things about HN is the comments in relation to the article not just the article.I had hoped it would include the discussion threads from that too."},{"rank":71,"user":"toomuchtodo","sugar_score":1.9491983812,"sweetest_comment":"Saw this on &#x2F;r&#x2F;SideProject. Excellent work."},{"rank":72,"user":"JoshTriplett","sugar_score":1.9131265621,"sweetest_comment":"Yeah, I should have said that more clearly.  Automatic memory management (never having to call free), not garbage collection.  Which is arguably more awesome: whenever the compiler can figure out at compile time when youll stop using memory, it can statically decide to reclaim it there."},{"rank":73,"user":"coldtea","sugar_score":1.8852094206,"sweetest_comment":"Well, since they were arrested for money laundering it can easily be generasiled to any Bitcoin exchange..."},{"rank":74,"user":"swombat","sugar_score":1.8514622757,"sweetest_comment":"The incredible quality of people that study there, and of the people that come out of it."},{"rank":75,"user":"peterwwillis","sugar_score":1.8471719654,"sweetest_comment":"Good point! I used to assume offsite implied offline, since Im used to offsite tape backups."},{"rank":76,"user":"axod","sugar_score":1.8372224075,"sweetest_comment":"Mazda are fantastic cars. Would recommend."},{"rank":77,"user":"rayiner","sugar_score":1.8343511783,"sweetest_comment":"I love how the rich and privileged in this hypothetical are the lambs."},{"rank":78,"user":"lifeisstillgood","sugar_score":1.8139793125,"sweetest_comment":"cool - it just has to Anti-matter weapons taking out planetary hubs with Minds directing the defences ... :-)"},{"rank":79,"user":"fleitz","sugar_score":1.8072180656,"sweetest_comment":"Indeed, the FBI has been so successful in the war on drugs, they are now actually able to keep drugs out of prisons."},{"rank":80,"user":"agumonkey","sugar_score":1.7502262181,"sweetest_comment":":) Good point, I never really investigated how to leverage them under linux because of program requiring a tty... Still good reminder."},{"rank":81,"user":"Mz","sugar_score":1.747115434,"sweetest_comment":"Some months ago, I googled up a number of \"dollar a day\" type food sites. There is lots of good stuff out there on the topic. I also like this one and have posted it elsewhere."},{"rank":82,"user":"mathattack","sugar_score":1.7466383158,"sweetest_comment":"Im a fan of MA, but I think people equate him with sainthood.  Hes not a saint.  Hes a pioneer that pushed the internet forward, made some mistakes, and now has some wisdom (and money) to dispense.  I give his writing some credence, but nobody is perfect.  I like that he has made post-browser mistakes.  That gives credibility to his writing."},{"rank":83,"user":"untog","sugar_score":1.7189733618,"sweetest_comment":"Yeah, this is absolutely stunning stuff. No doubt plenty will immediately cry foul and say that hes been set up, but lets wait and see what the investigation shows."},{"rank":84,"user":"lsc","sugar_score":1.7091161434,"sweetest_comment":"I really enjoyed that article... he put in to words many things that I feel are true about marketing.  (of course, he also seems to be assuming that Obama has won, and it's not over yet.)\"marketing is tribal\"  -  seems key to me.  Of course, I set out to create a product that I would want to use, so obviously, I am going to try to sell it to my tribe.  But yeah.  \"cool\" only applies within a tribe.  It has been obvious that if I want to sell to corporations (that is, executive decision makers)  I will need to get a sales person who knows how to handle that tribe."},{"rank":85,"user":"bdfh42","sugar_score":1.6975333228,"sweetest_comment":"A very good start point I would say."},{"rank":86,"user":"ars","sugar_score":1.6947464772,"sweetest_comment":"Paper uses more resources to recycle (especially water) than it uses to make it fresh. It's a feel good thing that does more harm than good.Putting paper in the ground is excellent from a CO2 sequestering point of view as well."},{"rank":87,"user":"throwaway2016a","sugar_score":1.6759857352,"sweetest_comment":"Awesome, thank you!"},{"rank":88,"user":"malkia","sugar_score":1.673306881,"sweetest_comment":"Awesome dude!"},{"rank":89,"user":"joshu","sugar_score":1.6668757486,"sweetest_comment":"It'd be neat if there were signed or invariant web documents. Perhaps naming things as their own checksum? This way, if it were ever changed (...) the document name would change and the reference would break. The client could check at retrieval time if the checksum matches the label?"},{"rank":90,"user":"raverbashing","sugar_score":1.6569201019,"sweetest_comment":"The cargo-culting of having to bring your startup to SF is getting tiringSuccessful startups pop everywhere. Lots in the East Coast (ok, NYC)Sure, the financing is there, but maybe, if SF is the only place your startup can get funding then maybe your business model is not the greatest?"},{"rank":91,"user":"d0m","sugar_score":1.6524543951,"sweetest_comment":"I started using tmux.. then switched to stumpwm which is too awesome to explain here. Embrace the full power of emacs and your Window Manager."},{"rank":92,"user":"chimeracoder","sugar_score":1.6461099217,"sweetest_comment":" doesn't require admin privileges to install.To be fair, neither does GNU Grep - just do `make' (without `make install') and you're good to go."},{"rank":93,"user":"ghshephard","sugar_score":1.6390419299,"sweetest_comment":"This ruling just created a great business opportunity for those companies creating technology that can effectively emulate a dogs smell-sensing capability."},{"rank":94,"user":"hga","sugar_score":1.6349414775,"sweetest_comment":"Very good, although you can have both at once, e.g. the 1929 crash had some aspects of an high tech equity bubble in radio.  I suspect the credit bubble part of it was overwhelmingly dominant, though."},{"rank":95,"user":"GFischer","sugar_score":1.6330057443,"sweetest_comment":"Working as intended :) . Try the right-hand side menu..."},{"rank":96,"user":"a3n","sugar_score":1.6324081783,"sweetest_comment":"$10, one time payment, is very good for this service."},{"rank":97,"user":"benologist","sugar_score":1.6115140098,"sweetest_comment":"Most of Playtomic, which looks like it's going to end the year with an awesome 10 billion events for December."},{"rank":98,"user":"anamax","sugar_score":1.6067808404,"sweetest_comment":"One finished project is usually worth more than seven half-finished projects. Hiring too many creative people would be bad?Yup.Focus matters."},{"rank":99,"user":"Turing_Machine","sugar_score":1.5946341253,"sweetest_comment":"Very impressive."},{"rank":100,"user":"mindcrime","sugar_score":1.5891555965,"sweetest_comment":"Looks pretty cool. Reminds me a lot of the ways in which Groovy improves Java."}]